{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.4.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 42], "dtype": "float32", "sparse": false, "ragged": false, "name": "hand_landmark"}, "name": "hand_landmark", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "15", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "15", "inbound_nodes": [[["hand_landmark", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "16", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "16", "inbound_nodes": [[["15", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "17", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "17", "inbound_nodes": [[["16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "18", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "18", "inbound_nodes": [[["17", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "19", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "19", "inbound_nodes": [[["18", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "gesture", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAQAAABTAAAAcxgAAABkAWQAbAB9AXwBagFqAnwAZAJkA40CUwApBE7pAAAA\nAOkBAAAAKQHaBGF4aXMpA9oKdGVuc29yZmxvd9oCbm7aB3NvZnRtYXgpAtoBeNoCdGapAHIJAAAA\n+mdDOi9Vc2Vycy90YWtlYi9BcHBEYXRhL0xvY2FsL1Byb2dyYW1zL1B5dGhvbi9QeXRob24zNi9s\naWIvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFzL2FjdGl2YXRpb25fbGF5ZXJzLnB52gx0YXJnZXRf\nbGF5ZXKPAAAAcwQAAAAAAQgB\n", null, null], "function_type": "lambda", "module": "onnx2keras.activation_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "gesture", "inbound_nodes": [[["19", 0, 0, {}]]]}], "input_layers": [["hand_landmark", 0, 0]], "output_layers": [["gesture", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "15/kernel", "shape": [42, 128], "dtype": "float32"}, {"name": "15/bias", "shape": [128], "dtype": "float32"}, {"name": "17/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "17/bias", "shape": [64], "dtype": "float32"}, {"name": "19/kernel", "shape": [64, 10], "dtype": "float32"}, {"name": "19/bias", "shape": [10], "dtype": "float32"}]}]}